-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 31, 2022 at 08:09 AM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 8.1.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news_system`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `category_id` int(11) NOT NULL,
  `category_name` varchar(255) CHARACTER SET utf8mb4 NOT NULL,
  `status` int(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`category_id`, `category_name`, `status`) VALUES
(1, 'شؤون فلسطينية', 1),
(2, 'صحة', 1),
(3, 'رياضة', 1),
(4, 'تكنولوجيا', 1),
(5, 'سياسة', 1),
(6, 'ثقافة', 1),
(7, 'اقتصاد', 1);

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2022_07_19_063358_news', 1),
(6, '2022_07_19_083241_news', 1),
(7, '2022_07_19_220520_categories', 1);

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `news_id` int(11) NOT NULL,
  `news_title` varchar(255) CHARACTER SET utf8mb4 NOT NULL,
  `news_image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `news_details` text CHARACTER SET utf8mb4 NOT NULL,
  `category_id` int(11) NOT NULL,
  `views` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`news_id`, `news_title`, `news_image`, `news_details`, `category_id`, `views`) VALUES
(1, 'بذكرى انقلاب ميانمار.. الجيش يمدد حالة الطوارئ والمتظاهرون ينظمون إضرابا', '4fbe818a-6678-4f78-ae7b-1be61166fcae.webp', 'أعلن مجلس الدفاع والأمن في ميانمار تمديد حالة الطوارئ في البلاد لمدة 6 أشهر تنتهي نهاية يوليو/تموز المقبل، في وقت نظم فيه المحتجون اليوم الثلاثاء \"إضرابا ضد الانقلاب\" في أنحاء البلاد، لإحياء الذكرى الأولى لوقوعه.\r\n\r\nوأقر مينت سوي، القائم بأعمال رئيس ميانمار، تمديد حالة الطوارئ بناءً على طلب قائد الجيش مين أونغ ليانغ، حسب بيان بثته القناة الحكومية، التي نقلت عن قائد الجيش قوله إن العنف ما زال مستمرا في بعض المناطق.\r\nوفي سياق متصل بهذه التطورات وتزامنا مع ذكرى الانقلاب العسكري الأولى، نظم المتظاهرون احتجاجات متفرقة صباح اليوم الثلاثاء في مدن مختلفة في أنحاء البلاد، ورددوا شعارات تنادي بالحرية والعدالة.\r\n\r\n', 5, 10),
(2, 'رونالدو يعود إلى ملعب تدريب مانشستر يونايتد.. ما أسباب رغبته في الرحيل؟ ولماذا ترفضه الأندية؟', '90070.jpg', 'عاد الهداف البرتغالي كريستيانو رونالدو إلى ملعب تدريب مانشستر يونايتد الإنجليزي صباح اليوم الثلاثاء مع وكيل أعماله خورخي مينديز، لكن مستقبله في أولد ترافورد ما زال غامضا.\r\n\r\nولم يشارك رونالدو بعد في تدريبات مانشستر، وغاب عن جولة الفريق في تايلاند وأستراليا، وتردد أنه أجرى محادثات أخيرا مع المدرب الجديد إيريك تين هاغ.\r\n\r\nولم يكشف مانشستر أي مستجدات بشأن الوضع الحالي لرونالدو في النادي عقب قدومه إلى ملعب الفريق مع مينديز الذي التقطته الصور يركب في سيارة رونالدو إلى جواره.\r\nما أسباب رغبته بالرحيل؟ ولماذا ترفضه الأندية؟\r\nوقال المدرب المغربي يوسف الدهبي، صديق أحد المقربين من رونالدو، للجزيرة نت، إن النجم البرتغالي لا يريد الاستمرار مع مانشستر يونايتد بسبب عدم تأهل الفريق لدوري أبطال أوروبا، إذ يشعر بأن بطولة الدوري الأوروبي لا تليق بمكانته الكروية بوصفه أفضل لاعب في العالم 5 مرات وهداف العالم.\r\n\r\nوأضاف الدهبي أن تعثر انضمام رونالدو لأي فريق من الفرق التي ستشارك في دوري الأبطال الموسم المقبل يعود لراتبه الضخم الذي لن يقلّ بأي حال عن 30 مليون يورو سنويا كما كان يتقاضى في يوفنتوس الإيطالي.\r\nوأوضح الدهبي أن رونالدو أمامه خياران لا ثالث لهما، الأول أن يتنازل عن جزء كبير من راتبه السنوي للانضمام إلى فريق يلعب بدوري الأبطال، أو الاستمرار مع مانشستر يونايتد وهو الخيار الذي سيضطر إليه في النهاية حتى لا يهين تاريخه الكبير.وأشار إلى أن شخصية رونالدو تتميز بالإصرار على تحقيق أهدافه فهو يتدرب جيدا ويحافظ على صحته العامة، لكن هذا الهدف قد يخيّب آماله للاعتبارات السابقة التي يضاف إليها أنه يرفض أن يجلس احتياطيا كما أنه يشكل سطوة في أي فريق يلعب فيه، وهذه خطوط حمر لمعظم المدربين بخاصة الكبار منهم.\r\n\r\nوكان السير أليكس فيرجسون المدرب الأسطورة السابق لمانشستر حاضرا في ملعب التدريبات في وقت سابق اليوم الثلاثاء، علما بأنه لعب دورا محوريا في عودة رونالدو إلى أولد ترافورد العام الماضي.\r\n\r\nوينطلق موسم الدوري الإنجليزي الممتاز بعد أقل من أسبوعين، ويستهل مانشستر مشواره بملاقاة ضيفه برايتون في السابع من أغسطس/آب المقبل.', 3, 0),
(3, 'رحيل رونالدو عن مانشستر يونايتد.. متى يتوقف الهراء؟', '1353055.webp', 'هناك \"ميم\" (Meme) متداول من مسلسل كارتون \"CatDog\" اشتهر بشدة في السنوات الأخيرة، يظهر فيه الفأر \"وينزلو ت. أودفِلو\" وهو يخرج من جحره، ثم في المشهد التالي مباشرة يظهر عائدا إلى جحره مغلقا الباب خلفه، في حركة ميكانيكية واعية تماما.\r\n\r\nهذا \"الميم\" عادة ما يُستخدم مع التغريدات شديدة الغباء مثلا، أو الآراء المُغرِقة في التطرف؛ يخرج \"وينزلو\" من جحره، ويراها، فيعود مجددا في استسلام لأنه ليس جاهزا للتعامل مع هذا الهراء كما يقول أهل بلده.\r\n\r\nمع الوقت، أصبح هذا \"الميم\" هو أكثر ما يُتداول عن \"وينزلو\". أغلب الناس عرفوا شخصيته من خلاله أصلا، لأن أغلب الناس خارج الولايات المتحدة الأميركية لا يشاهدون قناة \"Nickelodeon\" ولم يسمعوا عن مسلسل \"CatDog\" من قبل، وبالتالي ليسوا مُلمّين بالسياق الذي أتت فيه اللقطة، وإنما فقط يعلمون كيف تُستخدم على الشبكة. \r\nبالطبع يمكنك أن تتخيل كيف أوجد ذلك قدرا من الحيرة؛ هل استخدامها بعد إعلان رونالدو رغبته في الرحيل يعني السخرية من رونالدو نفسه، باعتبار أن رحيله سيكون مفاجأة بعد ما حدث وما قيل عند التوقيع معه، أم أنه يسخر من نادي مانشستر يونايتد، بعد أن فشل في استغلال نجوميته وأهدافه، ليس في المنافسة على اللقب، بل حتى في اللحاق بمقعد مؤهل لدوري الأبطال؟\r\n\r\nهُراء\r\nما يُغذِّي هذه الحيرة باستمرار هو صعوبة الاتفاق على تعريف واضح للهراء الذي يُعيد \"وينزلو\" إلى جحره مرة أخرى بعد أن كان متحمسا ومنفتحا على الحياة. في الواقع، يصعب أن نتفق حتى على هوية \"وينزلو\" في هذه الحكاية؛ هل هو رونالدو، أم مانشستر يونايتد، أم المدرب المؤقت رالف رانييك؟\r\n\r\nبعد تعيينه في نهاية نوفمبر/تشرين الثاني، كان رالف رانييك يقترح بيع رونالدو على الإدارة في يناير/كانون الثاني، والسبب كان بسيطا ومفهوما؛ رونالدو يخلق معضلة لا حل لها، وهي أن الألماني المولع بالضغط والتحولات، الذي يولي أهمية كبيرة لهيكل الفريق التكتيكي في المراحل المختلفة، لا يستطيع اللعب برونالدو في التشكيل الأساسي، وفي الوقت ذاته هو لا يستطيع إبقاءه على الدكّة، لأنه يُسجِّل الكثير من الأهداف. (2)\r\n\r\nمانشستر يونايتد الذي تولى رانييك إدارته في نوفمبر/تشرين الثاني كان يحتاج إلى رونالدو بشدة في الملعب، ولكن مانشستر يونايتد الذي كان يحاول رانييك بناءه -وإن فشل- كان يحتاج إلى رونالدو على الدكّة. بعد شهر واحد فقط، كان رانييك قد أدرك أن الهراء الحقيقي هو أن نادي مانشستر يونايتد لم يدرك هذه المعضلة إلا بعد فوات الأوان. \r\nهذا هو الأصل في القصة، لأن مجلس الإدارة الذي قرَّر التعاقد مع أسطورته السابقة هو العنصر الوحيد الذي سيظل مشتركا بين نسختَيْ الفريق المتعارضتين؛ تلك الموجودة حاليا، وتلك التي أتى رانييك ليصنعها، أو حتى تلك التي سيصنعها تن هاخ في المستقبل.\r\n\r\nأغلب الظن أن مجلس الإدارة كان يفكر بالطريقة ذاتها التي فكَّر بها منذ رحيل فيرغسون؛ الافتراض غير العقلاني بأن كل شيء سيصبح على ما يُرام عند لحظة ما، لا لسبب إلا أن هذا هو مانشستر يونايتد، وأن استمرار الحال على ما هو عليه سيعني أن هناك مصيبة حقيقية، ولا يمكن للمصائب الحقيقية أن تحدث عندما يكون مدربك أسطورة من أساطير جيل 1999، أو عندما يكون مهاجمك أفضل لاعب مرَّ على النادي في تاريخه. المصائب تحدث للآخرين فقط.\r\n\r\nإدارة مانشستر يونايتد ظنَّت بأن الوصول إلى المركز الثاني خلف سيتي، في موسم بدَّل فيه تشيلسي مدربه، واجتاحت فيه الإصابات ليفربول لدرجة احتياجهم إلى معجزة للتأهل لدوري الأبطال، هو إنجاز يمكن البناء عليه. هذا يشبه أن تحكم على قدرات سوبرمان وهو على كوكب كريبتون، ثم تتخيل أن هذا سيكون حاله على الأرض، والفارق الوحيد هنا أن مانشستر يونايتد قد رأى ما يمكن لتشيلسي وليفربول إنجازه فعلا في الظروف الطبيعية، ولم يكن بحاجة إلى الاستنتاج.\r\nما أسوأ شيء قد يحدث إن تعاقدت مع رونالدو وسانشو وفاران بعد أن أحرزت المركز الثاني خلف مانشستر سيتي؟ لا بد أن هذا السؤال قد طُرح بهذه الصيغة بالضبط في أحد مكاتب كارنغتون بعد نهاية الصيف الماضي، ولا بد أن إجابته كانت محسومة في نظر الكثيرين خارج كارنغتون أيضا. (4)\r\n', 3, 1),
(4, 'لقاء الرئيس عباس هنية.. هل سيحرّك المياه الراكدة في ملف المصالحة؟\r\n\r\n', '9999181236.jpg', 'وصف خبراء ومحللون سياسيون، اللقاء الذي جمع الرئيس الفلسطيني محمود عباس، برئيس المكتب السياسي لحركة حماس،إسماعيل هنية، أمس، خلال حضور احتفالات ذكرى استقلال الجزائر بالأمر البروتوكولي، الذي قد ينعكس بصورة إيجابية ومهمة لتحريك المياه الراكدة في ملف المصالحة الفلسطينية.\r\n\r\nوقد وصل الرئيس عباس، إلى العاصمة الجزائرية، تلبية لدعوة نظيره، عبد المجيد تبون، لحضور احتفالات ذكرى استقلال الجزائر.\r\n\r\nكما وصل وفد من حركة (حماس) برئاسة هنية، إلى الجزائر، مساء الأحد، للمشاركة في احتفالات ذكرى استقلال الجزائر، تلبية لدعوة الرئيس عبد المجيد تبون.\r\n\r\nوعقد الرئيس الجزائري، لقاءً يجمع كل من الرئيس عباس، ورئيس المكتب السياسي لحركة (حماس) إسماعيل هنية، في قصر المؤتمرات غرب العاصمة الجزائر على هامش مشاركة الوفد الفلسطيني في احتفالات الذكرى الستين لاستقلال الجزائر.\r\n\r\nوفيما يتعلق بتغطية وسائل الإعلام الرسمية الفلسطينية، الإعلام الخاص بحركة حماس، للقاء، لم تنشر وكالة الأنباء الفلسطينية (وفا) عبر صفحتها أي معلومات عن اللقاء، فيما وصف موقع حركة حماس الرسمي عبر الإنترنت، خلال تصريح مقتضب، اللقاء بـ \"الأخوي\"\r\n\r\nوقبل أشهر، أطلقت الجزائر جهودًا لاتمام ملف المصالحة بين مختلف الفصائل الفلسطينية تمهيدا لمؤتمر يسبق القمة العربية المقررة بالجزائر في تشرين الثاني نوفمبر/  المقبل.\r\n\r\nمن جانبه، قال المحلل السياسي، طلال عوكل، إن \"اللقاء الذي تم بالأمس، بحضور الرئيس الجزائري، إيجابي، حيث أنه كان يتقصد ذلك عندما دعا الاثنين إلى الجزائر بمناسبة حفل الاستقلال، وعلى الأرجح سيحرّك القضية مرة أخرى من خلال تصريحات وربما حوارات\".\r\n\r\nوتابع في حديث خاص لـ\"دنيا الوطن\": أن \"المياه الراكدة في موضوع الانقسام راكدة كثيرًا، فهو موضوع عميق ولم يعد من السهل تجاوز هذا الواقع الذي أصبح مُمَأسس وله أشكال \"قانونية\".\r\n\r\nوأوضح عوكل أن \"موضوع الاتصالات والحوارات هو لاحق ولن يتم الآن من قبل الرئيس عباس وإسماعيل هنية في الجزائر، في العموم وسائل الإعلام الفلسطينية الرسمية وغير الرسمية تتحفظ، لأن هناك حذر من الإفراط في التفاؤل وإعطاء هذه اللمحة أبعاد غير واقعية\".\r\n\r\nورجّح المحلل السياسي، أن \"يتبع تلك المشاهد بعد وقت اتصالات وحوارات في الجزائر أو في أكثر من مكان لافتًا إلى أن القضية ليست بالسهلة\".\r\n\r\nبدوره، اعتبر الكاتب والمحلل السياسي، د.حسام الدجني، أن\"هذه الصور واللقاء الذي خرج أقرب إلى البُعد البروتوكولي، الذي يساهم بشكل أو بالأخر في إنجاح الجهود الجزائرية، مرجحًا أنه قد لا ينبى عليه كثيراً في موضوع المصالحة، لأنه ارتباطات المصالحة كثيرة ومتشعبة جدًا وبحاجة إلى إرادة حقيقية، وموقف دولي وإقليمي محرك في ملف المصالحة\".\r\n\r\nوقال إن \"هذا اللقاء مهم وهو الأول ربما منذ أكثر من خمسة عشر عامًا وعندما يكون اثنين، رأس السلطة وفتح مع رأس حماس هذا بالتأكيد يمكن أن يُبنى عليه بشكل تقديري أن الرئيس أبو مازن قد يكون معنيًا بإنجاز المصالحة في نهاية ولايته وحماس معنية أيضًا في إنجاز المصالحة في ظل البيئة المحلية الفلسطينية والواقع الصعب الذي أثر سلبًا على المشروع الوطني\".\r\n\r\nوأردف القول: \"قد تنجح الجهود ولكن بحاجة إلى إرادة وبحاجة إلى موقف دولي وقضايا أخرى بعيدًا عن الصورة وعن البروتوكول الذي حدث في الشقيقة الجزائر\".\r\n\r\nويرى أن \"وسائل الإعلام لا تُريد أن ترفع السقف لدى الرأي العام الفلسطيني، لافتًا إلى أن الرأي العام الفلسطيني لم يعد يكترث كثيرًا لمثل هذه اللقاءات، لأن التجارب السابقة تثير الإحباط\". موضحًا أنه \"لا يمكننا من مجرد صورة أن نقول أن المصالحة أُنجزت والقضية الفلسطينية نهضت والمشروع الفلسطيني أيضًا نهض أرى أن في ذلك مبالغًا\".\r\n\r\nولفت إلى أنه \"في ذات الوقت لا يمكننا تقزيم دلالات الصورة والموقف، ويمكن أن يُبنى عليه في حال توفرت الإرادة الحقيقة\".\r\n\r\n وأشار الدجني إلى أن \"الموقف الدولي بالغ الأهمية ولا سيما الأمريكي، فاحتواء غزة والضفة الغربية، يدلل على أن هناك توجه كبير في المنطقة بالذات إيران، وهذا يتطلب هدوء وربما يعطي تحول في الموقف الأمريكي تجاه انجاز مصالحة أو أن تبدأ الولايات المتحدة الأمريكية في حالة بقاء الانقسام مقابل ازدهار وتمويل كل طرف مقابل من أجل أن يكون هناك رخاء لحماس في غزة ورخاء لفتح في الضفة دون أن تًنجز المصالحة\".\r\n\r\nوختم الحديث: \"لا أعتقد أننا من الممكن أن نرفع سقف التوقعات والأمل من هذه الصورة ولكن يجب أن يتم البناء عليها من ناحية أن يكون هناك حوارات فعلاً بين الرأسين، هنية وعباس لمناقشة كل الوضع الفلسطيني المتأزم\".\r\n\r\nأما المحلل السياسي، د. أحمد رفيق عوض، فهو يرى أن هذا \"اللقاء بالتأكيد هو مهم، لكنه لن يكون حدث دراماتيكي يُغيّر من إيقاع المصالحة، هذا لقاء فرضه المكان والبروتوكول والمجاملة وأراد الرجلان هنية وأبو مازن أن يعطوا للرئيس الجزائر صورة جميلة في يوم استقلال الجزائر، وربما يحتاج الرئيس الجزائري لتلك الصورة، ليقول أنه فعل شيئًا\".\r\n\r\nوقال عوض إن \"المصالحة معقدة، وتتعقد كثر وأكثر، وأعتقد أن لهذا اللقاء معنى قبل مجيئ بايدن، أنه في حالة لم يأتِ لم تسفر زيارة بايدن عن أية نتائج ملامس فيمكن أن تفتح الطريق امام مصالحة عميقة وحقيقة، لأنه عند إذا ما الذي ننتظره من أمريكا.\r\n\r\nوتابع: \"هذا اللقاء لا أعتقد أن يشكل فاتحة دراماتيكية لمصالحة ولكنها جاءت بسبب المكان والبروتوكول والمجاملة ولكنها أيضًا رسالة للأمريكان بأن السلطة الوطنية الفلسطينية لديها خيارات كثيرة من أجل الرد على إفلاس عملية التسوية\".\r\n\r\nوأضاف: \"تجاهل وسائل الإعلام وتعاملها بهذا البرود والحيادية مع الصور فيه دلالة على أن ذلك اللقاء لا يشكل أساس وانطلاقة، ولم تجري فيه نقاش حقيقي موسع من أجل الانطلاق نحو مصالحة، وهذا يؤكد أيضًا أن الرئيس الجزائري يريد صورة جميلة لشعبه ولنفسه والبروتوكول فرض نفسه\".\r\n\r\n', 1, 0),
(5, '‫هذه التغيرات الجلدية تنبئ بمرض السكري', '9999183209.jpg', 'قالت جمعية السكري الألمانية إن بعض ‫التغيرات الجلدية تنذر بالإصابة بداء السكري، أبرزها البقع البنية ‫المستديرة، والتي تتخذ شكل الندبات.\r\n\r\n‫وأوضحت الجمعية أن هذه التغيرات الجلدية غالبا ما تظهر على قصبة الساق ‫والقدمين والساعدين.\r\nوشددت الجمعية على ضرورة استشارة الطبيب فور ملاحظة هذه التغيرات ‫الجلدية، ولا سيما إذا كانت مصحوبة بالأعراض المميزة لداء السكري ‫والمتمثلة في العطش الشديد وكثرة الرغبة في التبول وفقدان الوزن.\r\n\r\n‫من ناحية أخرى، أوصت الجمعية مرضى السكري بالعناية اليومية بالجلد ‫باستخدام منتجات العناية المرطبة، والتي تحتوي على الجلسرين والبانثينول ‫والألوفيرا وفيتامين \"إي\" (E) واليوريا.', 2, 0),
(6, 'الكرش العاطفي.. كيف تتسبب مشاعرنا في السمنة؟', '9999180105.jpg', 'ما تأثير المشاعر على السلوك الغذائي للإنسان؟ وكيف تكون بعض الحالات العاطفية سببا في الإقبال على تناول أطعمة معينة تؤدي إلى زيادة الوزن؟\r\n\r\nالكيلوغرامات العاطفية:\r\nتقول الكاتبة أورو إيميلي في تقرير نشرته صحيفة \"لوفيغارو\" (lefigaro) الفرنسية إن \"الكيلوغرامات العاطفية\" عبارة قد تبدو مجرد دعابة، ولكنها في الواقع مستخدمة من قبل العديد من اختصاصي التغذية وعلم النفس، وتم تأليف العديد من الكتب حول هذه الظاهرة.\r\nوتنقل الكاتبة عن لورنس أورا اختصاصية علم النفس والتغذية الفرنسية، ومؤلفة كتاب \"ماذا لو وجدت أخيرا وزنك المثالي؟\"، تأكيدها أن الحديث حول هذا الموضوع يجد صدى لدى القراء الذين يعترفون بأن إقبالهم على الأكل واختيارهم الأطعمة يتأثر بحالات الغضب والحزن.\r\n\r\nالتغذية العاطفية والوزن الزائد\r\nوتقول ساندرين بينو اختصاصية التغذية والأستاذة المحاضرة في جامعة السوربون في باريس، والمشاركة في دراسة حول التغذية العاطفية والوزن الزائد -نشرت في المجلة الأميركية للتغذية السريرية- \"بشكل عام، إن المشاعر القوية تقطع الشهية لدى الإنسان، ولكن الحالات العاطفية التي يمر بها تؤثر على سلوكه بأشكال أخرى، وترتبط مباشرة بالتجارب التي مر بها في طفولته وشكلت علاقته بالطعام\".\r\nوتوضح الكاتبة أن هذه الفكرة تعني أن الطفل الرضيع تكون علاقته بالطعام بسيطة، حيث إنه يتناوله فقط عندما يشعر بالجوع. ولكن تجارب الطفولة تعقد هذه العلاقة، وتخلق روابط بين العاطفة والأكل.\r\n\r\nالأغذية الغنية بالسعرات الحرارية\r\nوتضيف الكاتبة أن هذا السلوك يريح الإنسان بشكل فوري، وهو ما يجعله يكرره في المرات المقبلة، حيث إن المخ لديه اختيارات مدروسة في هذه الحالات العاطفية، إذ يتجه إلى الأغذية الغنية بالسعرات الحرارية مثل المرطبات والبسكويت والشوكولاتة ورقائق البطاطا، عوضا عن التوجه لمأكولات أخرى صحية مثل الفواكه والخضر.\r\n\r\nوتوضح ساندرين بينو أن هذا الاختيار يجعل الجسم يحصل على كمية كبيرة من السعرات الحرارية، وينشط الناقلات العصبية في الجسم، ويؤدي إلى إفراز السيروتونين والدوبامين مما ينعكس إيجابيا على المزاج. حيث إن نظام المكافأة في الجسم ينشط ويخلق حالة من الشعور بالمتعة، وفجأة يشعر الإنسان بأنه انتقل بحالته العاطفية من الحضيض نحو مكان أفضل، رغم أن هذا الشعور بالرضا مؤقت لسوء الحظ.\r\n\r\nالتفكير في علاقتنا مع الطعام\r\nلذلك تؤكد لورونس أورو ضرورة التفكير في علاقتنا مع الطعام، قبل التركيز على المحتوى الموجود في الصحن، حيث يجب علينا التعامل مع هذا الأمر بوعي، وتجنب فكرة \"أنا منزعج لذلك أنا آكل\".\r\n\r\nوتنصح الكاتبة بالتركيز على المشاعر الذاتية والتدرب على التحكم فيها، ثم في مرحلة أخرى يمكن التفكير في تغيير الأطعمة التي نتناولها لتكون أكثر صحية.\r\n', 2, 0),
(7, 'الفدرالي الأميركي يرفع الفائدة مجددا بمقدار 75 نقطة أساس لمكافحة التضخم', '9999180203.jpg', 'فع البنك الاحتياطي الفدرالي الأميركي اليوم الأربعاء سعر الفائدة القياسي مرة أخرى بمقدار 3 أرباع نقطة مئوية (0.75%) إلى نطاق بين 2.25% و2.50%، وقال إنه ستكون هناك حاجة إلى مزيد من الزيادات في معركته المستمرة للحد من ضغوط الأسعار المتزايدة.\r\n\r\nوهذه الزيادة هي الثانية على التوالي بمقدار 75 نقطة أساس، ورابع مرة تُرفع فيها الفائدة هذا العام، مع تحرك حكام البنك المركزي الأميركي بقوة لتهدئة أقوى زيادة في التضخم منذ أكثر من 4 عقود، تجنبا للركود في أكبر اقتصاد بالعالم.\r\n\r\nوأشار الاحتياطي الفدرالي إلى أن البيانات تظهر \"ضعف الإنفاق والإنتاج\" على الرغم من الزيادة القوية في استحداث الوظائف. وأكد المركزي الأميركي أنه \"ملتزم بقوة\" بإعادة التضخم إلى مستوى 2% المستهدف.\r\n\r\nورأى الفدرالي الأميركي أن حرب روسيا ضد أوكرانيا تتسبب في صعوبات بشرية واقتصادية هائلة، وقال في بيان \"تخلق الحرب والأحداث ذات الصلة ضغطا تصاعديا إضافيا على التضخم وتؤثر على النشاط الاقتصادي العالمي\".\r\nوأضاف \"تسعى لجنة السوق المفتوحة لتحقيق أقصى قدر من التوظيف، بينما تستهدف نسبة تضخم بمعدل 2% على المدى الطويل.. ودعما لهذه الأهداف، قررت اللجنة رفع أسعار الفائدة بمقدار 75 نقطة أساس\".\r\n\r\nوأكد أنه سيواصل تقليل مقتنياته من سندات الخزانة وديون الوكالات والأوراق المالية المدعومة بالرهن العقاري للوكالة، كما ستواصل لجنة السوق المفتوحة لدى الفدرالي الأميركي مراقبة السوق، وفق البيان.\r\n\r\nوختم \"نحن على استعداد لتعديل موقف السياسة النقدية بالشكل المناسب إذا ظهرت مخاطر قد تعرقل تحقيق أهداف اللجنة\".\r\n\r\nوفي الخليج العربي، قرر مصرف قطر المركزي رفع سعر فائدة الإقراض 50 نقطة أساس، وزاد سعر فائدة الإيداع بمقدار 75 نقطة أساس.\r\nكما أعلن بنك الكويت المركزي أنه قرر رفع سعر الخصم بواقع ربع نقطة مئوية إلى 2.50% من 2.25% اعتبارا من الغد.\r\n\r\nوأعلن باسل الهارون محافظ بنك الكويت المركزي في بيان صحفي أنه تقرر أيضا إجراء تعديل بنسب متفاوتة في أسعار التدخل بالسوق النقدي المطبقة حاليا على جميع آجال هيكل سعر الفائدة.\r\n\r\nوقال إن هذا يشمل عمليات إعادة الشراء (الريبو) وسندات وتورق بنك الكويت المركزي ونظام قبول الودائع لأجل، وأدوات التدخل المباشر، بالإضافة إلى أدوات الدين العام.\r\n\r\nوقرر مصرف البحرين المركزي رفع سعر الفائدة الأساسي على ودائع الأسبوع الواحد بمقدار 75 نقطة أساس.', 7, 0);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `user_id` int(11) NOT NULL,
  `username` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`user_id`, `username`, `password`, `email`) VALUES
(1, 'maryam_ashqarr', 'e10adc3949ba59abbe56e057f20f883e', 'maryamkashqar@gmail.com');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`category_id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`news_id`),
  ADD KEY `category_id` (`category_id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `category_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `news_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
